Early look into WR progression. </br>
And a kickoff to **From the Blocks** !! </br>
Yeehaw, baby!

In [178]:
# libraries
import pandas as pd
import numpy as np
import os
from IPython.display import display

In [157]:
# data load
path = '/Users/orly/Desktop/Swim Stats/WR Progression'
wr = pd.read_csv(os.path.join(path, 'WRProgression.csv'))

In [158]:
# new columns / data manipulation

# stroke and distance, extract from event column
wr[['Distance', 'Stroke']] = wr['Event'].str.split(' ', n = 1, expand = True)

In [171]:
# describe
print(wr.shape)

(1515, 14)

In [159]:
print(wr.columns)

Index(['Rank', 'Event', 'Sex', 'Time', 'Set', 'Note', 'Name', 'Nationality',
       'Date', 'Meet', 'Location', 'Comments', 'Distance', 'Stroke'],
      dtype='object')

In [160]:
print(wr.head(5))

  Rank    Event Sex   Time       Set Note             Name    Nationality  \
0    1  50 Free   M  23.86  En Route  NaN    Jonty Skinner   South Africa
1    2  50 Free   M  23.74       NaN  NaN       Joe Bottom  United States
2    3  50 Free   M  23.72       NaN  NaN  Ron Manganiello  United States
3    4  50 Free   M  23.70       NaN  NaN  Klaus Steinbach   West Germany
4    5  50 Free   M  23.66       NaN  NaN  Chris Cavanaugh  United States

      Date                        Meet  \
0  8/14/76               AAU Nationals
1   7/3/77                  Canada Cup
2  7/29/78                           -
3  7/23/79                           -
4   2/2/80  International Invitational

                                    Location Comments Distance Stroke
0  Philadelphia, Pennsylvania, United States      NaN       50   Free
1                          Etobicoke, Canada      NaN       50   Free
2              Miami, Florida, United States      NaN       50   Free
3                     Freiburg, West Germany      NaN       50   Free
4                    Amersfoort, Netherlands      NaN       50   Free

In [161]:
# will be doing a lot of analysis for men and women separately
# save separate datasets now to make it easier later
wrm = wr[wr['Sex'] == 'M']
wrf = wr[wr['Sex'] == 'F']

In [162]:
# start simple
# separate M and F
# how many swimmers are there?

# break out
swimmer_count_m = wrm['Name'].nunique()
swimmer_count_f = wrf['Name'].nunique()

# total
swimmer_count = wr['Name'].nunique()

print('There are', swimmer_count, 'total swimmers,', swimmer_count_m, 'men and', swimmer_count_f, 'women.')

There are 552 total swimmers, 288 men and 264 women.

In [186]:
# how many records has each swimmer set?
# men
records_m = wrm[['Name', 'Nationality']].value_counts().reset_index()
# print(records_m.head(5))
# records_m.head(5).to_clipboard()
display(records_m.head(6))

              Name    Nationality  count
0   Michael Phelps  United States     29
1       Mark Spitz  United States     24
2   Roland Matthes   East Germany     16
3  Don Schollander  United States     14
4       Ian Thorpe      Australia     13
5    Aaron Peirsol  United States     13

In [187]:
# women
records_f = wrf[['Name', 'Nationality']].value_counts().reset_index()
# print(records_f.head(5))
display(records_f.head(6))

              Name    Nationality  count
0   Kornelia Ender   East Germany     24
1     Debbie Meyer  United States     15
2  Ragnhild Hveger        Denmark     15
3    Katie Ledecky  United States     15
4      Dawn Fraser      Australia     15
5  Donna de Varona  United States     13

In [181]:
# records by country
# men
records_bycountry_m = wrm['Nationality'].value_counts().reset_index()
# print(records_bycountry_m.head(5))
display(records_bycountry_m.head(5))

     Nationality  count
0  United States    380
1      Australia    103
2          Japan     42
3   Soviet Union     33
4  Great Britain     26

In [184]:
# women
records_bycountry_f = wrf['Nationality'].value_counts().reset_index()
# print(records_bycountry_f.head(5))
display(records_bycountry_f)

       Nationality  count
0    United States    253
1     East Germany    116
2        Australia     96
3      Netherlands     62
4          Germany     21
5     South Africa     20
6          Denmark     19
7           Canada     18
8           Sweden     18
9            China     16
10    Soviet Union     15
11           Japan     14
12           Italy     11
13   Great Britain     10
14         Hungary      8
15          Russia      5
16          France      4
17       Lithuania      4
18         Belgium      4
19         Romania      4
20        Zimbabwe      4
21  United Kingdom      3
22    West Germany      2
23          Poland      2
24     New Zealand      1
25           Spain      1
26          Brazil      1
27          Canada      1
28         Ukraine      1

In [165]:
# swimmers with records in the most different events
# get list of swimmer names and event name
# remove dups
# count number of times each name pops up

# men
differentm1 = wrm[['Name', 'Event']].drop_duplicates().reset_index(drop = True)
differentm2 = differentm1.groupby('Name').count().reset_index()
differentm2.columns = ('Name', 'Count')
differentm3 = differentm2.sort_values(by = 'Count', ascending = False).reset_index(drop = True)
print(differentm3.head(5))

                 Name  Count
0      Michael Phelps      5
1          Mark Spitz      5
2  Johnny Weissmuller      4
3        John Konrads      4
4       Michael Gross      4

In [166]:
# women
differentf1 = wrf[['Name', 'Event']].drop_duplicates().reset_index(drop = True)
differentf2 = differentf1.groupby('Name').count().reset_index()
differentf2.columns = ('Name', 'Count')
differentf3 = differentf2.sort_values(by = 'Count', ascending = False).reset_index(drop = True)
print(differentf3.head(5))

              Name  Count
0      Shane Gould      6
1   Kornelia Ender      6
2  Ragnhild Hveger      5
3   Helene Madison      5
4  Martha Norelius      4

In [167]:
# shortest time between records in the same event

# make a new variable for each event that shows count of days between date of WRs
# do I need to split it up by event?

In [168]:
# longest time between records in the same event

In [169]:
# records set at Olympics vs. not

# search for "oly" and then remove trials meets
# try this in excel first maybe, see if it gets everything?
# can do checks by year and time of year (i.e., multiples of 4 and summertime)